package com.example.illustratedhandbook;

import java.util.List;

public class JTBDetailesSmall {
    /**
     * statusCode : 000000
     * desc : 请求成功
     * result : {"petID":2,"name":"八哥鸟","engName":"Acridotherescristatellus","nation":"陕西南部至长江以南各省，以及台湾和海南省均有分布","easyOfDisease":"寄生虫、沙门氏、大肠杆菌","life":"二十二年","price":"25\u2014100","des":"　　八哥鸟为中国常见的观赏鸟之一，也是我国独有的观赏鸟之一。自古以来，八哥鸟就是王公贵族们的玩耍之物，有很多文学作品和历史文献中都有提到过八哥鸟。如今，八哥鸟因为非常有灵性，并且通体黑色的外观非常特殊，深受人们的喜爱，将八哥鸟当做宠物鸟来饲养的也越来越多。根据《中国大百科全书》介绍，雄性八哥一般寿命在8~10年左右，雌性八哥一般寿命在10~12年左右。野生八哥一般寿命比笼养的短1~2年！据史书记载，唐朝年间有一大户人家养的一雌性八哥生命力极强，寿命达二十二年。　八哥　Acridotherescristatellus鸲鹆了哥、鹦鹆、寒皋、鸜鹆、驾鸰、加令、凤头八哥　脊索动物门亚门鸟纲　今鸟亚纲　雀形目　鸣禽亚目　椋鸟科　八哥属　八哥　陕西南部至长江以南各省，以及台湾和海南省均有分布。","feature":"　　八哥鸟通体黑色，粗看起来颇似乌鸦，但与乌鸦有着显着的区别。八哥鸟以黄嘴黄脚、尾羽有白色羽端、尾下覆羽全白、全身羽毛黑色并且呈现金属光泽的雄鸟为上乘。以胆子较大，会鸣唱，站立式挺胸、亮翅，个头比较大的八哥鸟为上品。八哥","characterFeature":"　　八哥鸟自古以来就是宫廷的玩赏鸟，如今在我国的　　给八哥鸟洗澡要特别注意，太小的八哥不适合给它洗澡。因为小八哥身体抵抗力弱，稍不注意它就容易感冒生病。一般情况下，八哥鸟也都会自己梳理羽毛，保持身体干净。所以，我们也不用频繁的给它洗澡。当然，如果八哥身体比较脏，那彻底的给它洗个澡也是必要的咯。　　有网友支招：认为给八哥洗澡最好等到太阳猛烈的时候开始，先将它拿出去暴晒（当然要用布遮住鸟笼，时间也不能太长，不能让八哥出现中暑、脱水的情况哦）。然后用大盆装上一盆温水（不要那种透心凉的水哦，否则八哥鸟很容易就会生病的），将八哥鸟放在水里，一般八哥鸟就会自己去扑腾扑腾了，在这个过程中你只要从旁协助八哥洗澡就可以了。等10分钟过去后，八哥鸟也洗的差不多了，然后将它拿出来，用干的毛巾擦干身体，（或者用吹风机替它吹干羽毛也可以）。　\n　二、训练方法\n　　1.训练八哥学话语须从幼鸟开始。每次放幼鸟出笼15分钟左右，笼的周围放些鸟喜欢吃的食物，这样多次反复训练雏鸟由学习达到能飞，这一阶段时间反射条件基本巩固，训练成功一大半。以后，在每次放飞出笼时，提请注意应减少受惊，也不要长期关在笼内，影响反射巩固成果。出进笼训练成功后，别忘记了笼内放几条昆虫，以便奖励。　　2.时间。以清晨最好，因鸟的鸣叫在清晨最为活跃，这时鸟尚未饱食，教学效果好。　　3.环境。要安静，不能有嘈杂声和谈话声，否则易分散鸟的注意力，也会使鸟学到不应该学的声音。因此最好选择在安静的室内进行教学。　　4.内容。开始时要选择简单的短名，如\u201c您好\u201d、\u201c欢迎\u201d、\u201c再见\u201d、\u201c拜拜\u201d、\u201c谢谢\u201d等。注意发音准确、清晰、缓慢，不用方言，最好用普通话。每天反复同教一样的话语，学会后还要巩固。在教学期间的鸟，不能让它听到无聊或不适当的语句。鸟的学语有一短暂时间特别敏感，这时对外界的各种声音极易仿效。一旦发现这一敏感期，应及时抓住，好好利用。","careKnowledge":"　　八哥属于比较好饲养的鸟类，因为他们善于模仿人语和其他声音，深受人们的喜爱。八哥体态优美，可以通过鸣叫来分辨雌雄，鸣叫声优美、激昂者为雄鸟，鸣声低沉、不悦耳者为雌鸟。野生八哥生活于山林、平原、村庄，家庭饲养八哥也应该尊重其习性，不然突然的环境变化也是会导致八哥的不适的。　\n　一、鸟笼挑选\n　　八哥属大型　　八哥鸟喜欢安静的环境，寒冷冬季饲养八哥鸟，一定要注意做好保暖工作，冬季外出遛鸟时一定要罩上笼衣。每天清晨可以将八哥鸟笼挂到窗口或户外呼吸新鲜空气1-1.5小时后，收回房内。","feedPoints":"　　现在人们饲养宠物鸟都是精养、细养，稍有一些异常，就会非常担心。聪明的八哥鸟对于鸟主人来说也是如此，所以，根据八哥鸟不同的生长发育期、不同季节来配制合适的饲料才是最健康的喂食方式。其实鸟儿的饲料虽然品种繁多，自己配制的饲料方法也多种多样，但是归结起来也是万变不离其宗，我们需要保证的是八哥能在不同时期、不同环境下都能保证自身的营养需要才是最重要的。所以，对于八哥鸟的喂食要求可以从以下九个方面来进行分析。　　说明：考虑到朋友们喂养的八哥数量大都在2只左右，所以按照最低配置。配制好之后放进冰箱的保藏柜里面，一星期内喂完。　　雏鸡饲料半市斤、鸡蛋4个〔半市斤左右〕、酵母片〔碾碎〕5片。如果添加鱼粉、牛羊肉粉，鸡蛋要相应减少。调成粥状。　　喂养：⑴初期按照鸟的生理特性，在吃完食物后的两个小时即可全部排泄的情况，每天可以多喂几次。特别是晚上要喂足喂饱。⑵10天左右之后开始添加墨鱼骨粉〔或者钙片〕。　\n　二、换食期的饲料：\n　　此时的饲料配制基本同雏八哥饲料，可在饲料中添加切碎的青菜或者水果〔喂时添加〕，用番茄酱最方便，可随鸡蛋一同掺入。配制的数量可多些。配制时要特别注意鸡蛋一定要分三次以上掺入，等前一次的饲料干燥之后再掺。一次掺入过多会导致饲料颗粒松散成为粉末，影响八哥的采食。　\n　三、日常饲料：\n　　雏鸡饲料一市斤、鸡蛋1个、酵母片〔碾碎〕5片、适量的墨鱼骨粉。　\n　四、换羽期饲料：\n　1、前期：仅喂雏鸡饲料，并且减少数量。需要4~7天的时间。　　2、中期：加大\u201c日常饲料\u201d里面的鸡蛋比例，用2~4个为宜。墨鱼骨粉也要加倍。添加二两花生粉。　　3、后期：逐渐减少鸡蛋和墨鱼骨粉的比例，恢复日常饲料喂养。　\n　五、秋末、冬季饲料：\n　　基本同日常饲料的配制，只是鸡蛋要增加一个，并适量的添加植物油〔一市斤饲料一两油〕或者花生粉二两。　　上述饲料是本着最经济实用的角度考虑的，其所含的营养成分都能满足八哥的生长需要。当然家庭喂养鸟的数量毕竟有限，很多朋友也就不考虑科学饲养，总是千方百计的给鸟改善生活，让鸟胖起来。　\n　六、水果和蔬菜的选择：\n　　水果中的矿物质和维生素的含量同蔬菜远远不能相比：白菜、萝卜的维生素C要比苹果、梨、桃高10倍左右；青椒和菜花要比草莓和柑橘高2~3倍。绝大多数的水果维生素C含量并不高，其他维生素更加有限。蛋白质含量都不足1%,几乎不含必需的脂肪酸。且由于贮存时间较长其营养物质降解，远不如蔬菜新鲜。其实鸟也有选择性，笼子里只放水果的话，鸟没有选择。　　适口性和营养是不同的概念，很多蔬菜稍微加加工给鸟即经济营养也高。毕竟新鲜的蔬菜到处都有，水果可是季节收获。　\n　七、微量元素、矿物质以及其他的补充：\n　　实践证明八哥由于是杂食鸟，饲料里面的营养成分足以满足其生长需要。在每次配制饲料的时候将鸡蛋壳碾碎放入即可，特殊阶段另添加一些其他辅料。没有必要再添加维生素类。　\n　八、坚持添加酵母片〔食母生〕：\n　　这样做不仅仅是帮助鸟消化，更重要的是酵母片里面含有丰富的各种饲料里面缺乏的营养。同时能使脂溶性维生素被鸟全面吸收。　\n　九、沙子：\n　　经常在鸟笼里面的沙罐里放些沙子让鸟自由采吃，鸟的自由空间小，消化能力自然削减，要想让饲料里面的各种营养全部被鸟吸收，沙子是最廉价最实用的。","imageURL":["http://www.boqii.com/entry/photo/1363/0","http://www.boqii.com/entry/photo/1363/5678"]}
     */

    private String statusCode;
    private String desc;
    private ResultBean result;

    public String getStatusCode() {
        return statusCode;
    }

    public void setStatusCode(String statusCode) {
        this.statusCode = statusCode;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * petID : 2
         * name : 八哥鸟
         * engName : Acridotherescristatellus
         * nation : 陕西南部至长江以南各省，以及台湾和海南省均有分布
         * easyOfDisease : 寄生虫、沙门氏、大肠杆菌
         * life : 二十二年
         * price : 25—100
         * des : 　　八哥鸟为中国常见的观赏鸟之一，也是我国独有的观赏鸟之一。自古以来，八哥鸟就是王公贵族们的玩耍之物，有很多文学作品和历史文献中都有提到过八哥鸟。如今，八哥鸟因为非常有灵性，并且通体黑色的外观非常特殊，深受人们的喜爱，将八哥鸟当做宠物鸟来饲养的也越来越多。根据《中国大百科全书》介绍，雄性八哥一般寿命在8~10年左右，雌性八哥一般寿命在10~12年左右。野生八哥一般寿命比笼养的短1~2年！据史书记载，唐朝年间有一大户人家养的一雌性八哥生命力极强，寿命达二十二年。　八哥　Acridotherescristatellus鸲鹆了哥、鹦鹆、寒皋、鸜鹆、驾鸰、加令、凤头八哥　脊索动物门亚门鸟纲　今鸟亚纲　雀形目　鸣禽亚目　椋鸟科　八哥属　八哥　陕西南部至长江以南各省，以及台湾和海南省均有分布。
         * feature : 　　八哥鸟通体黑色，粗看起来颇似乌鸦，但与乌鸦有着显着的区别。八哥鸟以黄嘴黄脚、尾羽有白色羽端、尾下覆羽全白、全身羽毛黑色并且呈现金属光泽的雄鸟为上乘。以胆子较大，会鸣唱，站立式挺胸、亮翅，个头比较大的八哥鸟为上品。八哥
         * characterFeature : 　　八哥鸟自古以来就是宫廷的玩赏鸟，如今在我国的　　给八哥鸟洗澡要特别注意，太小的八哥不适合给它洗澡。因为小八哥身体抵抗力弱，稍不注意它就容易感冒生病。一般情况下，八哥鸟也都会自己梳理羽毛，保持身体干净。所以，我们也不用频繁的给它洗澡。当然，如果八哥身体比较脏，那彻底的给它洗个澡也是必要的咯。　　有网友支招：认为给八哥洗澡最好等到太阳猛烈的时候开始，先将它拿出去暴晒（当然要用布遮住鸟笼，时间也不能太长，不能让八哥出现中暑、脱水的情况哦）。然后用大盆装上一盆温水（不要那种透心凉的水哦，否则八哥鸟很容易就会生病的），将八哥鸟放在水里，一般八哥鸟就会自己去扑腾扑腾了，在这个过程中你只要从旁协助八哥洗澡就可以了。等10分钟过去后，八哥鸟也洗的差不多了，然后将它拿出来，用干的毛巾擦干身体，（或者用吹风机替它吹干羽毛也可以）。　
         　二、训练方法
         　　1.训练八哥学话语须从幼鸟开始。每次放幼鸟出笼15分钟左右，笼的周围放些鸟喜欢吃的食物，这样多次反复训练雏鸟由学习达到能飞，这一阶段时间反射条件基本巩固，训练成功一大半。以后，在每次放飞出笼时，提请注意应减少受惊，也不要长期关在笼内，影响反射巩固成果。出进笼训练成功后，别忘记了笼内放几条昆虫，以便奖励。　　2.时间。以清晨最好，因鸟的鸣叫在清晨最为活跃，这时鸟尚未饱食，教学效果好。　　3.环境。要安静，不能有嘈杂声和谈话声，否则易分散鸟的注意力，也会使鸟学到不应该学的声音。因此最好选择在安静的室内进行教学。　　4.内容。开始时要选择简单的短名，如“您好”、“欢迎”、“再见”、“拜拜”、“谢谢”等。注意发音准确、清晰、缓慢，不用方言，最好用普通话。每天反复同教一样的话语，学会后还要巩固。在教学期间的鸟，不能让它听到无聊或不适当的语句。鸟的学语有一短暂时间特别敏感，这时对外界的各种声音极易仿效。一旦发现这一敏感期，应及时抓住，好好利用。
         * careKnowledge : 　　八哥属于比较好饲养的鸟类，因为他们善于模仿人语和其他声音，深受人们的喜爱。八哥体态优美，可以通过鸣叫来分辨雌雄，鸣叫声优美、激昂者为雄鸟，鸣声低沉、不悦耳者为雌鸟。野生八哥生活于山林、平原、村庄，家庭饲养八哥也应该尊重其习性，不然突然的环境变化也是会导致八哥的不适的。　
         　一、鸟笼挑选
         　　八哥属大型　　八哥鸟喜欢安静的环境，寒冷冬季饲养八哥鸟，一定要注意做好保暖工作，冬季外出遛鸟时一定要罩上笼衣。每天清晨可以将八哥鸟笼挂到窗口或户外呼吸新鲜空气1-1.5小时后，收回房内。
         * feedPoints : 　　现在人们饲养宠物鸟都是精养、细养，稍有一些异常，就会非常担心。聪明的八哥鸟对于鸟主人来说也是如此，所以，根据八哥鸟不同的生长发育期、不同季节来配制合适的饲料才是最健康的喂食方式。其实鸟儿的饲料虽然品种繁多，自己配制的饲料方法也多种多样，但是归结起来也是万变不离其宗，我们需要保证的是八哥能在不同时期、不同环境下都能保证自身的营养需要才是最重要的。所以，对于八哥鸟的喂食要求可以从以下九个方面来进行分析。　　说明：考虑到朋友们喂养的八哥数量大都在2只左右，所以按照最低配置。配制好之后放进冰箱的保藏柜里面，一星期内喂完。　　雏鸡饲料半市斤、鸡蛋4个〔半市斤左右〕、酵母片〔碾碎〕5片。如果添加鱼粉、牛羊肉粉，鸡蛋要相应减少。调成粥状。　　喂养：⑴初期按照鸟的生理特性，在吃完食物后的两个小时即可全部排泄的情况，每天可以多喂几次。特别是晚上要喂足喂饱。⑵10天左右之后开始添加墨鱼骨粉〔或者钙片〕。　
         　二、换食期的饲料：
         　　此时的饲料配制基本同雏八哥饲料，可在饲料中添加切碎的青菜或者水果〔喂时添加〕，用番茄酱最方便，可随鸡蛋一同掺入。配制的数量可多些。配制时要特别注意鸡蛋一定要分三次以上掺入，等前一次的饲料干燥之后再掺。一次掺入过多会导致饲料颗粒松散成为粉末，影响八哥的采食。　
         　三、日常饲料：
         　　雏鸡饲料一市斤、鸡蛋1个、酵母片〔碾碎〕5片、适量的墨鱼骨粉。　
         　四、换羽期饲料：
         　1、前期：仅喂雏鸡饲料，并且减少数量。需要4~7天的时间。　　2、中期：加大“日常饲料”里面的鸡蛋比例，用2~4个为宜。墨鱼骨粉也要加倍。添加二两花生粉。　　3、后期：逐渐减少鸡蛋和墨鱼骨粉的比例，恢复日常饲料喂养。　
         　五、秋末、冬季饲料：
         　　基本同日常饲料的配制，只是鸡蛋要增加一个，并适量的添加植物油〔一市斤饲料一两油〕或者花生粉二两。　　上述饲料是本着最经济实用的角度考虑的，其所含的营养成分都能满足八哥的生长需要。当然家庭喂养鸟的数量毕竟有限，很多朋友也就不考虑科学饲养，总是千方百计的给鸟改善生活，让鸟胖起来。　
         　六、水果和蔬菜的选择：
         　　水果中的矿物质和维生素的含量同蔬菜远远不能相比：白菜、萝卜的维生素C要比苹果、梨、桃高10倍左右；青椒和菜花要比草莓和柑橘高2~3倍。绝大多数的水果维生素C含量并不高，其他维生素更加有限。蛋白质含量都不足1%,几乎不含必需的脂肪酸。且由于贮存时间较长其营养物质降解，远不如蔬菜新鲜。其实鸟也有选择性，笼子里只放水果的话，鸟没有选择。　　适口性和营养是不同的概念，很多蔬菜稍微加加工给鸟即经济营养也高。毕竟新鲜的蔬菜到处都有，水果可是季节收获。　
         　七、微量元素、矿物质以及其他的补充：
         　　实践证明八哥由于是杂食鸟，饲料里面的营养成分足以满足其生长需要。在每次配制饲料的时候将鸡蛋壳碾碎放入即可，特殊阶段另添加一些其他辅料。没有必要再添加维生素类。　
         　八、坚持添加酵母片〔食母生〕：
         　　这样做不仅仅是帮助鸟消化，更重要的是酵母片里面含有丰富的各种饲料里面缺乏的营养。同时能使脂溶性维生素被鸟全面吸收。　
         　九、沙子：
         　　经常在鸟笼里面的沙罐里放些沙子让鸟自由采吃，鸟的自由空间小，消化能力自然削减，要想让饲料里面的各种营养全部被鸟吸收，沙子是最廉价最实用的。
         * imageURL : ["http://www.boqii.com/entry/photo/1363/0","http://www.boqii.com/entry/photo/1363/5678"]
         */

        private int petID;
        private String name;
        private String engName;
        private String nation;
        private String easyOfDisease;
        private String life;
        private String price;
        private String des;
        private String feature;
        private String characterFeature;
        private String careKnowledge;
        private String feedPoints;
        private List<String> imageURL;

        public int getPetID() {
            return petID;
        }

        public void setPetID(int petID) {
            this.petID = petID;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getEngName() {
            return engName;
        }

        public void setEngName(String engName) {
            this.engName = engName;
        }

        public String getNation() {
            return nation;
        }

        public void setNation(String nation) {
            this.nation = nation;
        }

        public String getEasyOfDisease() {
            return easyOfDisease;
        }

        public void setEasyOfDisease(String easyOfDisease) {
            this.easyOfDisease = easyOfDisease;
        }

        public String getLife() {
            return life;
        }

        public void setLife(String life) {
            this.life = life;
        }

        public String getPrice() {
            return price;
        }

        public void setPrice(String price) {
            this.price = price;
        }

        public String getDes() {
            return des;
        }

        public void setDes(String des) {
            this.des = des;
        }

        public String getFeature() {
            return feature;
        }

        public void setFeature(String feature) {
            this.feature = feature;
        }

        public String getCharacterFeature() {
            return characterFeature;
        }

        public void setCharacterFeature(String characterFeature) {
            this.characterFeature = characterFeature;
        }

        public String getCareKnowledge() {
            return careKnowledge;
        }

        public void setCareKnowledge(String careKnowledge) {
            this.careKnowledge = careKnowledge;
        }

        public String getFeedPoints() {
            return feedPoints;
        }

        public void setFeedPoints(String feedPoints) {
            this.feedPoints = feedPoints;
        }

        public List<String> getImageURL() {
            return imageURL;
        }

        public void setImageURL(List<String> imageURL) {
            this.imageURL = imageURL;
        }
    }
}
